canhembed/xiaozhi-esp32/main/audio/audio_service.cc
        auto task = std::move(audio_playback_queue_.front());
        audio_playback_queue_.pop_front();
        output_in_flight_ = true;
        audio_queue_cv_.notify_all();
        lock.unlock();

        if (!codec_->output_enabled()) {
            esp_timer_stop(audio_power_timer_);
            esp_timer_start_periodic(audio_power_timer_, AUDIO_POWER_CHECK_INTERVAL_MS * 1000);
            codec_->EnableOutput(true);
        }

        if (task->playback_id != 0 && callbacks_.on_playback_progress) {
            callbacks_.on_playback_progress(task->playback_id, task->media_position_ms);
        }

        codec_->OutputData(task->pcm);

        /* Update the last output time */
        last_output_time_ = std::chrono::steady_clock::now();
        debug_statistics_.playback_count++;

        bool notify_drained = false;
        lock.lock();
#if CONFIG_USE_SERVER_AEC
        /* Record the timestamp for server AEC */
        if (task->timestamp > 0) {
            timestamp_queue_.push_back(task->timestamp);
        }
#endif
        output_in_flight_ = false;
        notify_drained = MarkPlaybackDrainedLocked();
        audio_queue_cv_.notify_all();
        lock.unlock();

        if (notify_drained && callbacks_.on_playback_drained) {
            callbacks_.on_playback_drained();
        }
    }

    ESP_LOGW(TAG, "Audio output task stopped");
}

void AudioService::OpusCodecTask() {
    while (true) {
        std::unique_lock<std::mutex> lock(audio_queue_mutex_);
        audio_queue_cv_.wait(lock, [this]() {
            return service_stopped_.load() ||
                !audio_encode_queue_.empty() ||
                (!audio_decode_queue_.empty() && audio_playback_queue_.size() < MAX_PLAYBACK_TASKS_IN_QUEUE);
        });
        if (service_stopped_.load()) {
            break;
        }

        /* Decode the audio from decode queue */
        if (!audio_decode_queue_.empty() && audio_playback_queue_.size() < MAX_PLAYBACK_TASKS_IN_QUEUE) {
            auto packet = std::move(audio_decode_queue_.front());
            audio_decode_queue_.pop_front();
            decode_in_flight_ = true;
            const uint32_t generation = playback_generation_;
            audio_queue_cv_.notify_all();
            lock.unlock();

            bool decoded = false;
            auto task = std::make_unique<AudioTask>();
            task->type = kAudioTaskTypeDecodeToPlaybackQueue;
            task->timestamp = packet->timestamp;
            task->playback_id = packet->playback_id;
            task->media_position_ms = packet->media_position_ms;

            if (packet->format == 0 && opus_decoder_ != nullptr) { // 0 is OPUS
                SetDecodeSampleRate(packet->sample_rate, packet->frame_duration);
                task->pcm.resize(decoder_frame_size_);
                esp_audio_dec_in_raw_t raw = {
                    .buffer = (uint8_t *)(packet->payload.data()),
                    .len = (uint32_t)(packet->payload.size()),
                    .consumed = 0,
                    .frame_recover = ESP_AUDIO_DEC_RECOVERY_NONE,
                };
                esp_audio_dec_out_frame_t out_frame = {
                    .buffer = (uint8_t *)(task->pcm.data()),
                    .len = (uint32_t)(task->pcm.size() * sizeof(int16_t)),
                    .decoded_size = 0,
                };
                esp_audio_dec_info_t dec_info = {};
                std::unique_lock<std::mutex> decoder_lock(decoder_mutex_);
                auto ret = esp_opus_dec_decode(opus_decoder_, &raw, &out_frame, &dec_info);
                decoder_lock.unlock();
                if (ret == ESP_AUDIO_ERR_OK) {
                    task->pcm.resize(out_frame.decoded_size / sizeof(int16_t));
                    if (decoder_sample_rate_ != codec_->output_sample_rate() && output_resampler_ != nullptr) {
                        uint32_t target_size = 0;
                        esp_ae_rate_cvt_get_max_out_sample_num(output_resampler_, task->pcm.size(), &target_size);
                        std::vector<int16_t> resampled(target_size);
                        uint32_t actual_output = target_size;
                        esp_ae_rate_cvt_process(output_resampler_, (esp_ae_sample_t)task->pcm.data(), task->pcm.size(),
                                                (esp_ae_sample_t)resampled.data(), &actual_output);
                        resampled.resize(actual_output);
                        task->pcm = std::move(resampled);
                    }
                    decoded = true;
                } else {
                    ESP_LOGE(TAG, "Failed to decode audio after resize, error code: %d", ret);
                }
            } else if (packet->format == 2 && aac_decoder_ != nullptr) { // 2 is AAC
                // Prepend residual data if any
                if (!aac_residual_buffer_.empty()) {
                    packet->payload.insert(packet->payload.begin(), aac_residual_buffer_.begin(), aac_residual_buffer_.end());
                    aac_residual_buffer_.clear();
                }

                esp_audio_dec_in_raw_t raw = {
                    .buffer = (uint8_t*)packet->payload.data(),
                    .len = (uint32_t)packet->payload.size(),
                    .consumed = 0,
                    .frame_recover = ESP_AUDIO_DEC_RECOVERY_NONE
                };

                // AAC frame output: max 2048 samples per channel, 2 ch = 4096 int16
                std::vector<int16_t> full_pcm;
                std::vector<int16_t> temp_pcm(8192);
                bool decode_success = false;

                while (raw.len > 0) {
                    esp_audio_dec_out_frame_t out_frame = {
                        .buffer = (uint8_t*)temp_pcm.data(),
                        .len = (uint32_t)(temp_pcm.size() * sizeof(int16_t))
                    };
                    esp_audio_dec_info_t dec_info = {};
                    std::unique_lock<std::mutex> decoder_lock(decoder_mutex_);
                    auto ret = esp_aac_dec_decode(aac_decoder_, &raw, &out_frame, &dec_info);
                    decoder_lock.unlock();

                    if (ret == ESP_AUDIO_ERR_OK) {
                        size_t pcm_samples = out_frame.decoded_size / sizeof(int16_t);
                        // Downmix stereo to mono if needed
                        if (dec_info.channel == 2) {
                            int16_t* src = (int16_t*)out_frame.buffer;
                            size_t mono_samples = pcm_samples / 2;
                            std::vector<int16_t> mono(mono_samples);
                            for (size_t i = 0; i < mono_samples; ++i) {
                                mono[i] = (int32_t(src[i * 2]) + src[i * 2 + 1]) / 2;
                            }
                            if (dec_info.sample_rate != (uint32_t)codec_->output_sample_rate() && output_resampler_ != nullptr) {
                                uint32_t target_size = 0;
                                esp_ae_rate_cvt_get_max_out_sample_num(output_resampler_, mono_samples, &target_size);
                                std::vector<int16_t> resampled(target_size);
                                uint32_t actual_output = target_size;
                                esp_ae_rate_cvt_process(output_resampler_, (esp_ae_sample_t)mono.data(), mono_samples,
                                                        (esp_ae_sample_t)resampled.data(), &actual_output);
                                full_pcm.insert(full_pcm.end(), resampled.begin(), resampled.begin() + actual_output);
                            } else {
                                full_pcm.insert(full_pcm.end(), mono.begin(), mono.end());
                            }
                        } else {
                            if (dec_info.sample_rate != (uint32_t)codec_->output_sample_rate() && output_resampler_ != nullptr) {
                                uint32_t target_size = 0;
                                esp_ae_rate_cvt_get_max_out_sample_num(output_resampler_, pcm_samples, &target_size);
                                std::vector<int16_t> resampled(target_size);
                                uint32_t actual_output = target_size;
                                esp_ae_rate_cvt_process(output_resampler_, (esp_ae_sample_t)out_frame.buffer, pcm_samples,
                                                        (esp_ae_sample_t)resampled.data(), &actual_output);
                                full_pcm.insert(full_pcm.end(), resampled.begin(), resampled.begin() + actual_output);
                            } else {
                                int16_t* pcm_data = (int16_t*)out_frame.buffer;
                                full_pcm.insert(full_pcm.end(), pcm_data, pcm_data + pcm_samples);
                            }
                        }
                        decode_success = true;

                        // Advance raw buffer
                        if (raw.consumed > 0 && raw.consumed <= raw.len) {
                            raw.buffer += raw.consumed;
                            raw.len -= raw.consumed;
                        } else {
                            break;
                        }
                    } else if (ret == ESP_AUDIO_ERR_DATA_LACK) {
                        // Need more data
                        aac_residual_buffer_.assign(raw.buffer, raw.buffer + raw.len);
                        break;
                    } else {
                        // Skip bytes to resync on next ADTS header
                        size_t skip = (raw.consumed > 0) ? raw.consumed : 1;
                        if (skip > raw.len) skip = raw.len;
                        raw.buffer += skip;
                        raw.len -= skip;
                    }
                }

                if (decode_success && !full_pcm.empty()) {
                    task->pcm = std::move(full_pcm);
                    decoded = true;
                }
            } else {
                ESP_LOGE(TAG, "Audio decoder is not configured or unsupported format: %d", packet->format);
            }

